Documents/бит_СвидетельствоОРегистрацииПоМестуПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_СвидетельствоОРегистрацииПоМестуПребывания</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоВидуОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируемоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ФИОПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ФИОПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПаспортныеДанныеПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПаспортныеДанныеПроживающих</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ДокументыУдостоверяющиеЛичность</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрацииПоМестуЖительства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументПричинаЗамены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/бит_СвидетельствоОРегистрацииПоМестуПребывания/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

&НаСервере
Функция ПолучитьИнициалы(Строка)
	
	Если НЕ ПустаяСтрока(Строка) Тогда
		
		Если СтрНайти(Строка, ".") Тогда
			Возврат Строка;
		КонецЕсли;
		
		ФИО = СтрРазделить(Строка, " ", Ложь);
		
		Отчество = "";
		Фамилия = "";
		Имя = "";
		
		Если ФИО.Количество() = 3 Тогда
			Фамилия = ФИО[0];
			Имя = ФИО[1];
			Отчество = ФИО[2];
		ИначеЕсли ФИО.Количество() = 2 Тогда
			Фамилия = ФИО[0];
			Имя = ФИО[1];	
		Иначе
			Фамилия = ФИО[0];
		КонецЕсли;
		
		ФамилияИнициалы = Фамилия 
		+?(ЗначениеЗаполнено(Имя), " " + Лев(Имя,1), "") 
		+?(ЗначениеЗаполнено(Отчество),". " + Лев(Отчество,1)+".", ""); 	
		
		Возврат ФамилияИнициалы;
	КонецЕсли;
	Возврат "";
КонецФункции

// БИТ_ЖКХ Функция.
//
// Параметры:
//
//
// Возвращаемое значение:
//  Результат – Строка.
//
Функция Печать(Документ) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("НетОшибок"        , Истина);
	Результат.Вставить("СообщениеОбОшибке", "");
	Результат.Вставить("ТабДокумент"      , Новый ТабличныйДокумент);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Документ);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Документ.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвидетельствоОРегистрацииПоМестуПребывания.Организация,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Ответственный,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Комментарий,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет,
	|	СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ДатаРегистрации,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ДатаСнятияСРегистрации,
	|	ФИОФизЛицСрезПоследних.Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя,
	|	ФИОФизЛицСрезПоследних.Отчество,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание КАК ДомРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Квартира КАК КвартираРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПОДСТРОКА(СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо.МестоРождения, 1, 200) КАК МестоРождения,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Номер,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПодразделения КАК КодПодразделения
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК СвидетельствоОРегистрацииПоМестуПребывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.Ответственный = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|ГДЕ
	|	СвидетельствоОРегистрацииПоМестуПребывания.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Результат.НетОшибок         = Ложь;
		Результат.СообщениеОбОшибке = "Не найдены данные по документу.";
	КонецЕсли; 
	
	Выборка.Следующий();
	
	ЗапросЗаявление = Новый Запрос;
	ЗапросЗаявление.Текст = "ВЫБРАТЬ
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ОрганФМСКудаПрибыл.Руководитель КАК Руководитель,
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ДатаРегистрации КАК ДатаРегистрации,
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ОрганФМСКудаПрибыл.Должность КАК ДолжностьДЛО
	                        |ИЗ
	                        |	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	                        |ГДЕ
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.Ссылка = &Ссылка";
	ЗапросЗаявление.УстановитьПараметр("Ссылка", Документ);
	
	ВыборкаЗаявление = ЗапросЗаявление.Выполнить().Выбрать();	
	
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("СОРПМЖ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	АдресПрибытия = Строка(Выборка.ПочтовыйАдрес)+", кв."+Строка(Выборка.КвартираРег);
	АдресПрибытия_1 = "";
	АдресПрибытия_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 75, АдресПрибытия_1, АдресПрибытия_2);
	ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
	ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
		
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	// БИТ_ЖКХ 22.09.2015 17:41:33 Начало правки...
	Если ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
		КодПФР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ВидДокумента, "КодПФР");
		Если ЗначениеЗаполнено(КодПФР) Тогда
			ШапкаОбласть.Параметры.ВидДокумента = КодПФР;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ВыданДокумент) Тогда
		
		ВыданДокумент1 = "";
		ВыданДокумент2 = "";
		ВыданДокументСтр = Выборка.ВыданДокумент
		+?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), ", код: " + Выборка.ДокументКодПодразделения, "");
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВыданДокументСтр, 60, ВыданДокумент1, ВыданДокумент2);
		
		ШапкаОбласть.Параметры.ВыданДокумент1 = ВыданДокумент1;
		ШапкаОбласть.Параметры.ВыданДокумент2 = ВыданДокумент2;
		 	
	КонецЕсли;
	// БИТ_ЖКХ 22.09.2015 17:41:33 Конец правки.
	
	РегистрируемоеЛицоФИО = Выборка.РегистрируемоеЛицо.Наименование;
		
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) и  ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
		ШапкаОбласть.Параметры.ФизЛицо = РегистрируемоеЛицоФИО + ", "+ Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'");
	Иначе
		ШапкаОбласть.Параметры.ФизЛицо = РегистрируемоеЛицоФИО; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.МестоРождения) Тогда
		МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.МестоРождения, Истина);
		МестоРождения = ПолучитьАдресБезПодписей(МестоРождения);

		МестоРождения_1 = "";
		МестоРождения_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРождения, 75, МестоРождения_1, МестоРождения_2);
		ШапкаОбласть.Параметры.МестоРождения = МестоРождения_1;
		ШапкаОбласть.Параметры.МестоРождения2 = МестоРождения_2;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоРег  = Формат(Выборка.ДатаРегистрации,"ДФ=dd");
		ДатаМесяц 						= Формат(Выборка.ДатаРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцРег = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));                                                                
		ШапкаОбласть.Параметры.ГодРег    = Формат(Выборка.ДатаРегистрации,"ДФ=yy");
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоСнят = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd");
		ДатаМесяц 						= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцСнят = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));                                                                
		ШапкаОбласть.Параметры.ГодСнят   = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=yy");
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ШапкаОбласть.Параметры.ОрганУчета = Строка(Выборка.ПаспортнаяСлужба) + ?(ЗначениеЗаполнено(Выборка.КодПодразделения), " " + Выборка.КодПодразделения, "") ;
		
	КонецЕсли; 
	
	Если ТипЗнч(Выборка.ДомРег.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КонтактноеЛицо = Строка(Выборка.ДомРег.ПаспортнаяСлужба.ОсновноеКонтактноеЛицо);
		ШапкаОбласть.Параметры.КонтактноеЛицо = КонтактноеЛицо;
		
	КонецЕсли;
	
	Если ВыборкаЗаявление.Следующий() Тогда 
		
		Если ЗначениеЗаполнено(ВыборкаЗаявление.Руководитель) Тогда
			
			ШапкаОбласть.Параметры.Руководитель = ПолучитьИнициалы(ВыборкаЗаявление.Руководитель);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаЗаявление.ДолжностьДЛО) Тогда
			
			ШапкаОбласть.Параметры.ДолжностьДЛО = ВыборкаЗаявление.ДолжностьДЛО;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаЗаявление.ДатаРегистрации) Тогда
			
			ШапкаОбласть.Параметры.ЧислоДок = Лев(Формат(ВыборкаЗаявление.ДатаРегистрации, "ДФ=dd.MM.yyyy"), 2);
			ШапкаОбласть.Параметры.МесяцДок = Сред(Формат(ВыборкаЗаявление.ДатаРегистрации,"ДФ=dd.MM.yyyy"), 4 ,2);
			ШапкаОбласть.Параметры.ГодДок 	= Прав(Формат(ВыборкаЗаявление.ДатаРегистрации,"ДФ=dd.MM.yyyy"),2 );
			
		КонецЕсли;
		
	КонецЕсли;

	ТабДокумент.Вывести(ШапкаОбласть);
	Результат.ТабДокумент = ТабДокумент;
	
	Возврат Результат;
	
КонецФункции // ()

Функция ПечатьСОРПМЖДубликат(Документ) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("НетОшибок"        , Истина);
	Результат.Вставить("СообщениеОбОшибке", "");
	Результат.Вставить("ТабДокумент"      , Новый ТабличныйДокумент);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Ссылка" ,Документ);
	Запрос.УстановитьПараметр("Момент" ,КонецДня(Документ.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвидетельствоОРегистрацииПоМестуПребывания.Организация КАК Организация,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Ответственный КАК Ответственный,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Комментарий КАК Комментарий,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет КАК ЛицевойСчет,
	|	СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо КАК РегистрируемоеЛицо,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ДатаРегистрации КАК ДатаРегистрации,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
	|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
	|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.УлицаЛицевогоСчета КАК УлицаРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание КАК ДомРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Квартира КАК КвартираРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.Корпус КАК КорпусРег,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.ПочтовыйАдрес КАК ПочтовыйАдрес,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид КАК ВидДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия КАК СерияДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер КАК НомерДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачиДокумента,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК ВыданДокумент,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДатаРегистрацииПоМестуЖительства КАК ДатаРегистрацииПоМестуЖительства,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументВид КАК ВидДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументСерия КАК СерияДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументНомер КАК НомерДокументаПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументДатаВыдачи КАК ДатаВыдачиПред,
	|	ПаспортныеДанныеФизЛицСрезПоследних1.ДокументКемВыдан КАК ВыданДокументПред,
	|	ПОДСТРОКА(СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо.МестоРождения, 1, 200) КАК МестоРождения,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Номер КАК Номер,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.ПаспортнаяСлужба КАК ПаспортнаяСлужба,
	|	СвидетельствоОРегистрацииПоМестуПребывания.ЛицевойСчет.Здание.ПаспортнаяСлужба.КодПодразделения КАК КодПодразделения,
	|	СвидетельствоОРегистрацииПоМестуПребывания.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК СвидетельствоОРегистрацииПоМестуПребывания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&Момент, ) КАК ФИОФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.РегистрируемоеЛицо = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПаспортныеДанныеПроживающих.СрезПоследних(&Момент, ) КАК ПаспортныеДанныеФизЛицСрезПоследних1
	|		ПО СвидетельствоОРегистрацииПоМестуПребывания.Ответственный = ПаспортныеДанныеФизЛицСрезПоследних1.ФизЛицо
	|ГДЕ
	|	СвидетельствоОРегистрацииПоМестуПребывания.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Результат.НетОшибок         = Ложь;
		Результат.СообщениеОбОшибке = "Не найдены данные по документу.";
	КонецЕсли; 
	
	Выборка.Следующий();
	
	ЗапросЗаявление = Новый Запрос;
	ЗапросЗаявление.Текст = "ВЫБРАТЬ
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ОрганФМСКудаПрибыл.Руководитель КАК Руководитель,
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ДатаРегистрации КАК ДатаРегистрации,
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.ОрганФМСКудаПрибыл.Должность КАК ДолжностьДЛО,
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.ДокументОснование.Дата КАК ДатаДокумента
	                        |ИЗ
	                        |	Документ.бит_СвидетельствоОРегистрацииПоМестуПребывания КАК бит_СвидетельствоОРегистрацииПоМестуПребывания
	                        |ГДЕ
	                        |	бит_СвидетельствоОРегистрацииПоМестуПребывания.Ссылка = &Ссылка";
	ЗапросЗаявление.УстановитьПараметр("Ссылка", Документ);
	
	ВыборкаЗаявление = ЗапросЗаявление.Выполнить().Выбрать();	
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "ЗаявлениеОРегистрацииПоМестуПЖ";
	Макет         = ПолучитьМакет("СОРПМЖ_ДУБЛИКАТ");
	ШапкаОбласть  = Макет.ПолучитьОбласть("Шапка");
	АдресПрибытия = Строка(Выборка.ПочтовыйАдрес)+", кв."+Строка(Выборка.КвартираРег);
	АдресПрибытия = АдресПрибытия + 
	?(ЗначениеЗаполнено(ВыборкаЗаявление.ДатаРегистрации), " с " +  Формат(ВыборкаЗаявление.ДатаРегистрации,"ДФ=dd.MM.yyyy" ), "");
	АдресПрибытия_1 = "";
	АдресПрибытия_2 = "";
	бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(АдресПрибытия, 75, АдресПрибытия_1, АдресПрибытия_2);
	ШапкаОбласть.Параметры.АдресПрибытия_1 = АдресПрибытия_1;
	ШапкаОбласть.Параметры.АдресПрибытия_2 = АдресПрибытия_2;
		
	ШапкаОбласть.Параметры.Заполнить(Выборка);
	
	// БИТ_ЖКХ 22.09.2015 17:41:33 Начало правки...
	Если ЗначениеЗаполнено(Выборка.ВидДокумента) Тогда
		КодПФР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ВидДокумента, "КодПФР");
		Если ЗначениеЗаполнено(КодПФР) Тогда
			ШапкаОбласть.Параметры.ВидДокумента = КодПФР;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ВыданДокумент) Тогда
		
		ВыданДокумент1 = "";
		ВыданДокумент2 = "";
		ВыданДокументСтр = Выборка.ВыданДокумент
		+?(ЗначениеЗаполнено(Выборка.ДокументКодПодразделения), ", код: " + Выборка.ДокументКодПодразделения, "");
		
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(ВыданДокументСтр, 60, ВыданДокумент1, ВыданДокумент2);
		
		ШапкаОбласть.Параметры.ВыданДокумент1 = ВыданДокумент1;
		ШапкаОбласть.Параметры.ВыданДокумент2 = ВыданДокумент2;
		 	
	КонецЕсли;
	// БИТ_ЖКХ 22.09.2015 17:41:33 Конец правки.
	
	РегистрируемоеЛицоФИО = Выборка.РегистрируемоеЛицо.Наименование;
	
	//ФизЛицо_Склон = "";
	//ИсходСклонения = бит_ПаспортныйСтолСервер.Просклонять(РегистрируемоеЛицоФИО,3,Выборка.РегистрируемоеЛицо.Пол,ФизЛицо_Склон);
	//
	//Если ИсходСклонения Тогда
	//	РегистрируемоеЛицоФИО = ФизЛицо_Склон;
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо) и  ЗначениеЗаполнено(Выборка.РегистрируемоеЛицо.ДатаРождения) Тогда
		ШапкаОбласть.Параметры.ФизЛицо = РегистрируемоеЛицоФИО + ", "+ Формат(Выборка.РегистрируемоеЛицо.ДатаРождения,"ДФ='dd.MM.yyyy ""г.р.""'");
	Иначе
		ШапкаОбласть.Параметры.ФизЛицо = РегистрируемоеЛицоФИО; 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.МестоРождения) Тогда
		МестоРождения = бит_ПаспортныйСтолКлиетСервер.ПредставлениеМестаРождения(Выборка.МестоРождения, Истина);
		
		МестоРождения_1 = "";
		МестоРождения_2 = "";
		бит_ОбщегоНазначения.РазделитьТекстНаДвеСтроки(МестоРождения, 75, МестоРождения_1, МестоРождения_2);
		ШапкаОбласть.Параметры.МестоРождения = МестоРождения_1;
		ШапкаОбласть.Параметры.МестоРождения2 = МестоРождения_2;

	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.ДатаРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоРег  = Формат(Выборка.ДатаРегистрации,"ДФ=dd");
		ДатаМесяц 						= Формат(Выборка.ДатаРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцРег = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));                                                                
		ШапкаОбласть.Параметры.ГодРег    = Формат(Выборка.ДатаРегистрации,"ДФ=yy");
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
		
		ШапкаОбласть.Параметры.ЧислоСнят = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=dd");
		ДатаМесяц 						= Формат(Выборка.ДатаСнятияСРегистрации,"ДФ='дд.MMMM'");
		ШапкаОбласть.Параметры.МесяцСнят = Сред(ДатаМесяц, 4, СтрДлина(ДатаМесяц));                                                                
		ШапкаОбласть.Параметры.ГодСнят   = Формат(Выборка.ДатаСнятияСРегистрации,"ДФ=yy");
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Выборка.ДомРег) Тогда
		
		ШапкаОбласть.Параметры.ОрганУчета = Строка(Выборка.ПаспортнаяСлужба) + ?(ЗначениеЗаполнено(Выборка.КодПодразделения), " " + Выборка.КодПодразделения, "") ;
		
	КонецЕсли; 
	
	Если ТипЗнч(Выборка.ДомРег.ПаспортнаяСлужба) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		КонтактноеЛицо = Строка(Выборка.ДомРег.ПаспортнаяСлужба.ОсновноеКонтактноеЛицо);
		ШапкаОбласть.Параметры.КонтактноеЛицо = КонтактноеЛицо;
		
	КонецЕсли;
	
	Если ВыборкаЗаявление.Следующий() Тогда 
		
		Если ЗначениеЗаполнено(ВыборкаЗаявление.Руководитель) Тогда
			
			ШапкаОбласть.Параметры.Руководитель = ПолучитьИнициалы(ВыборкаЗаявление.Руководитель);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаЗаявление.ДолжностьДЛО) Тогда
			
			ШапкаОбласть.Параметры.ДолжностьДЛО = ВыборкаЗаявление.ДолжностьДЛО;	
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ДатаДокумента) Тогда
			
			ШапкаОбласть.Параметры.ЧислоДок = Лев(Формат(Выборка.ДатаДокумента, "ДФ=dd.MM.yyyy"), 2);
			ШапкаОбласть.Параметры.МесяцДок = Сред(Формат(Выборка.ДатаДокумента,"ДФ=dd.MM.yyyy"), 4 ,2);
			ШапкаОбласть.Параметры.ГодДок 	= Прав(Формат(Выборка.ДатаДокумента,"ДФ=dd.MM.yyyy"),2 );
			
		КонецЕсли;
		
	КонецЕсли;

	ТабДокумент.Вывести(ШапкаОбласть);
	Результат.ТабДокумент = ТабДокумент;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти


&НаСервере
Функция ПолучитьАдресБезПодписей(Адрес)
	
	СтрокаРезультат = СтрЗаменить(Адрес, "страна:", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "область:", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "район:", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "село (дер.):", "");
	СтрокаРезультат = СтрЗаменить(СтрокаРезультат, "Населенный пункт:", "");
	
	Возврат СтрокаРезультат;
	
КонецФункции

#КонецЕсли
